 ## re module in python is used for working with regular expression.(regular expression are sequence of characters that define a  search pattern, manly used for string matching, searching, extracting, replacing, and more ))

In [4]:
import pandas as pd 
import re 
import numpy as np
import seaborn as sns

In [8]:
df = pd.DataFrame([45, 'John', 89, 'Alice', 'Sam', 102, 'Bob'])
df

       0
0     45
1   John
2     89
3  Alice
4    Sam
5    102
6    Bob

In [9]:
def numeric_value(val):
    try:
        float(val)
        return True
    except ValueError:
        return False

In [10]:
df['numerical_data']=df[0].apply(lambda x:x if numeric_value(x) else None)
df['categorical_data']=df[0].apply(lambda x:x if not numeric_value(x) else None)

In [12]:
df

        A      B  A_numeric  B_numeric A_unit B_unit
0    45kg    3kg       45.0        3.0     kg     kg
1  100USD   5USD      100.0        5.0    USD    USD
2   200kg    1kg      200.0        1.0     kg     kg
3  150USD  10USD      150.0       10.0    USD    USD

In [11]:
df = pd.DataFrame({
    'A': ['45kg', '100USD', '200kg', '150USD'],
    'B': ['3kg', '5USD', '1kg', '10USD']
})

def extract_numeric(value):
    match = re.findall(r'\d+\.?\d*', value)
    return float(match[0]) if match else None

def extract_unit(value):
    # Simple regex to extract the unit (letters)
    match = re.findall(r'[A-Za-z]+', value)  # Match the letters (unit)
    return match[0] if match else None

df['A_numeric'] = df['A'].apply(extract_numeric)
df['B_numeric'] = df['B'].apply(extract_numeric)


df['A_unit'] = df['A'].apply(extract_unit)
df['B_unit'] = df['B'].apply(extract_unit)

df

        A      B  A_numeric  B_numeric A_unit B_unit
0    45kg    3kg       45.0        3.0     kg     kg
1  100USD   5USD      100.0        5.0    USD    USD
2   200kg    1kg      200.0        1.0     kg     kg
3  150USD  10USD      150.0       10.0    USD    USD